CSI API ETABS v1

# cDesignConcreteGetSeismicFramingType Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSeismicFramingType(
    	string Name,
    	ref int NumberItems,
    	ref string[] FrameName,
    	ref int[] FramingType,
    	eItemType ItemType = eItemType.Objects
    )

    Function GetSeismicFramingType (
    	Name As String,
    	ByRef NumberItems As Integer,
    	ByRef FrameName As String(),
    	ByRef FramingType As Integer(),
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDesignConcrete
    Dim Name As String
    Dim NumberItems As Integer
    Dim FrameName As String()
    Dim FramingType As Integer()
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.GetSeismicFramingType(Name,
    	NumberItems, FrameName, FramingType,
    	ItemType)

    int GetSeismicFramingType(
    	String^ Name,
    	int% NumberItems,
    	array<String^>^% FrameName,
    	array<int>^% FramingType,
    	eItemType ItemType = eItemType::Objects
    )

    abstract GetSeismicFramingType :
            Name : string *
            NumberItems : int byref *
            FrameName : string[] byref *
            FramingType : int[] byref *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

NumberItems

    Type: SystemInt32

FrameName

    Type: SystemString

FramingType

    Type: SystemInt32

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cDesignConcrete Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com